# 散乱的知识点
## 数字签名和CA数字证书的核心原理和作用
1. 没有https，将保证不了数据的机密性，容易泄密
- 只用同一把私钥的加密叫做对称加密
- 使用“倒序”来加密和解密就是私钥之一
- 会话密钥：私钥有期限，用户和网站的每一次对话都需要一把新的“私钥”，
- 网站有一把公钥和私钥，这两是成对的密钥，用公钥加密的内容，只能用私钥进行解密，这样的加密叫做非对称加密
2. 没有https，保证不了数据的完整性，有可能被更改
- 不确定用户收到的公钥是网站的还是中间人的，我们的网络通信需要“第三方”来解决公钥的信任问题。这个“第三方”简称CA，Certificate Authority
- 网站需要先把用来给用户加密的公钥放到大家都信任的第三方CA里，CA根据这把公钥以及其他信息生成了“数字证书”，“数字证书”相当于让这把公钥和该网站绑定起来
- CA收到网站的信息以及公钥以后，会对这些信息以及公钥进行哈希运算，CA自己也生成一对专门用于“数字证书”的公钥和私钥，用私钥给哈希字符加密，生成的字符叫做“数字签名”，从而CA就可以把含有CA“数字签名”的证书发给网站了。

## SSH协议握手核心过程